Dlubal.RFEM5.SolvingSystemMethodType
Type of analysis method

Dlubal.RFEM5.SolvingSystemMethodType.UnknownSolvingSystem
Unknown analysis method.

Dlubal.RFEM5.SolvingSystemMethodType.NewtonRaphson
Newton-Raphson

Dlubal.RFEM5.SolvingSystemMethodType.NewtonRaphsonPicard
Newton-Raphson combined with Picard

Dlubal.RFEM5.SolvingSystemMethodType.Picard
Picard

Dlubal.RFEM5.SolvingSystemMethodType.NewtonRaphsonConstantMatrix
Newton-Raphson with constant stiffness matrix

Dlubal.RFEM5.SolvingSystemMethodType.ModifiedNewtonRaphson
Modified Newton-Raphson

Dlubal.RFEM5.SolvingSystemMethodType.DynamicRelaxation
Dynamic relaxation